tap "homebrew/cask"

# TODO: gnu utils?
# gnu-sed gnu-tar gawk
# coreutils -> gdate
# findutils -> gxargs
# grep -> gegrep
# iproute2mac -> ip

brew "font-d2coding"

brew "tmux"
brew "universal-ctags"
brew "sqlite"
brew "pueue" # with `brew services start pueue`

cask "openlens"

brew "mysql"
brew "tidy-html5"

brew "trippy"

brew "jnv"
brew "wtfutil"
brew "pipet"
brew "btop"

cask "orbstack"
# cask "alacritty"
cask "wezterm"
cask "openvpn-connect"
cask "ngrok"
cask "raycast"


tap "FelixKratz/formulae"
cask "sketchybar" # with `brew services start sketchybar`
cask "font-hack-nerd-font"

tap "jorgerojas26/lazysql"
brew "lazysql"

# https://awslabs.github.io/data-on-eks/docs/resources/binpacking-custom-scheduler-eks
tap "aws/tap"
brew "eks-node-viewer"

tap "laishulu/homebrew"
brew "macism"

# brew "m-cli"

# cask "dbeaver-community"

## AI
# cask "deepl"
# cask "cursor"
# cask "lm-studio"
