tap "homebrew/cask"

# TODO: gnu utils?
# gnu-sed gnu-tar gawk
# coreutils -> gdate
# findutils -> gxargs
# grep -> gegrep
# iproute2mac -> ip

brew "tmux"
brew "universal-ctags"
brew "sqlite"

cask "openlens"

brew "mysql"
brew "tidy-html5"

brew "trippy"

brew "jnv"

cask "orbstack"
# cask "alacritty"
cask "wezterm"
cask "openvpn-connect"
cask "ngrok"
cask "raycast"


tap "FelixKratz/formulae"
cask "sketchybar" # with `brew services start sketchybar`
cask "font-hack-nerd-font"

# brew "m-cli"

# cask "dbeaver-community"

## AI
# cask "deepl"
# cask "cursor"
# cask "lm-studio"
