tap "homebrew/cask"

# TODO: gnu utils?
# gnu-sed gnu-tar gawk
# coreutils -> gdate
# findutils -> gxargs
# grep -> gegrep
# iproute2mac -> ip

################################
# Develop tools
brew "font-d2coding"
cask "font-hack-nerd-font"

cask "wezterm"
cask "raycast"

brew "tmux"
brew "tmuxinator"

brew "universal-ctags"
cask "orbstack"

cask "openvpn-connect"
cask "ngrok"

# cask 'bitwarden' -> recommend appstore install for safari
brew 'bitwarden-cli'

tap "FelixKratz/formulae"
cask "sketchybar" # with `brew services start sketchybar`

tap "laishulu/homebrew"
brew "macism" # Input source manager

# brew "tidy-html5"

################################
# Database tools
brew "sqlite"
brew "mysql"

tap "jorgerojas26/lazysql"
brew "lazysql"

# cask "dbeaver-community"
cask "beekeeper-studio"

################################
# Util tools
brew "pueue" # with `brew services start pueue`
brew "wtfutil"
brew "pipet" # is a cli web scraper
brew "xan" # is csv magician

brew "libreoffice"
brew "unoconv" # is a convert between different document formats

################################
# Local tools
brew "trippy" # network diagnositc tool
brew "btop"

################################
# Devops tools

# https://awslabs.github.io/data-on-eks/docs/resources/binpacking-custom-scheduler-eks
tap "aws/tap"
brew "eks-node-viewer"

# cask "tigervnc-viewer"
# cask "openlens"

# brew "m-cli"

## AI
# cask "deepl"
# cask "cursor"
# cask "lm-studio"
